# #44: Menata ulang penempatan kolom pada Data Frame

## Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan Data Frame

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  2  2  3  2
1  1  9  2  4  6
2  2  2  5  5  3
3  6  9  5  3  1
4  1  9  6  5  5

## Menata ulang penempatan kolom pada Data Frame

In [10]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  3  2  7  2  2
1  4  2  1  6  9
2  5  5  2  3  2
3  3  5  6  1  9
4  5  6  1  5  9

In [12]:
df

   A  B  C  D  E
0  7  2  2  3  2
1  1  9  2  4  6
2  2  2  5  5  3
3  6  9  5  3  1
4  1  9  6  5  5

In [14]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  3  2  7  2  2
1  4  2  1  6  9
2  5  5  2  3  2
3  3  5  6  1  9
4  5  6  1  5  9